Ran Plan for project: `eks/eksd_apnortheast2/eksdapne2-aylw` dir: `terraform/eks/eksd_apnortheast2/eksdapne2-aylw` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.eks.aws_autoscaling_group_tag.aws_node_termination_handler_asg[0] will be created
+ resource "aws_autoscaling_group_tag" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)

      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.eks.aws_autoscaling_group_tag.aws_node_termination_handler_asg[1] will be created
+ resource "aws_autoscaling_group_tag" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)

      + tag {
          + key                 = "aws-node-termination-handler/managed"
          + propagate_at_launch = true
          + value               = "true"
        }
    }

  # module.eks.aws_autoscaling_lifecycle_hook.aws_node_termination_handler_asg[0] will be created
+ resource "aws_autoscaling_lifecycle_hook" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = (known after apply)
    }

  # module.eks.aws_autoscaling_lifecycle_hook.aws_node_termination_handler_asg[1] will be created
+ resource "aws_autoscaling_lifecycle_hook" "aws_node_termination_handler_asg" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = (known after apply)
    }

  # module.eks.aws_eks_access_entry.access_entry["accountadmin"] will be created
+ resource "aws_eks_access_entry" "access_entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eksdapne2-aylw"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::816736805842:user/zerojin0312"
      + tags              = {
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "eks"
          + "shard_id"   = "eksdapne2"
        }
      + tags_all          = {
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "eks"
          + "shard_id"   = "eksdapne2"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.access_policy_association["accountadmin-kubeadmin"] will be created
+ resource "aws_eks_access_policy_association" "access_policy_association" {
      + associated_at = (known after apply)
      + cluster_name  = "eksdapne2-aylw"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::816736805842:user/zerojin0312"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.coredns will be created
+ resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.4-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eksdapne2-aylw"
      + configuration_values        = jsonencode(
            {
              + nodeSelector = {
                  + capacity_type = "cpu_on_demand"
                }
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.kube_proxy will be created
+ resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.32.0-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eksdapne2-aylw"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_node_group.eks_node_group["ondemand_default"] will be created
+ resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "eksdapne2-aylw"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + labels                 = {
          + "capacity_type" = "cpu_on_demand"
          + "cpu_chip"      = "intel"
        }
      + node_group_name        = "eksdapne2-aylw-ng-ondemand_default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::816736805842:role/eks-eksdapne2-aylw-ng"
      + release_version        = "1.32.1-20250212"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0644fd4658862804e",
          + "subnet-0bed9fa48e4bc8504",
        ]
      + tags                   = {
          + "Name"                                 = "eksdapne2-aylw-ng-ondemand_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-aylw" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eksdapne2-aylw-ng-ondemand_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-aylw" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = "lt-0bb5fc261a86e77d7"
          + name    = (known after apply)
          + version = "1"
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_eks_node_group.eks_node_group["spot_default"] will be created
+ resource "aws_eks_node_group" "eks_node_group" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "eksdapne2-aylw"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.large",
        ]
      + labels                 = {
          + "capacity_type" = "spot"
          + "cpu_chip"      = "intel"
        }
      + node_group_name        = "eksdapne2-aylw-ng-spot_default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::816736805842:role/eks-eksdapne2-aylw-ng"
      + release_version        = "1.32.1-20250212"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0644fd4658862804e",
          + "subnet-0bed9fa48e4bc8504",
        ]
      + tags                   = {
          + "Name"                                 = "eksdapne2-aylw-ng-spot_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-aylw" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eksdapne2-aylw-ng-spot_default"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/eksdapne2-aylw" = "owned"
          + "product"                              = "eks"
          + "shard_id"                             = "eksdapne2"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = "lt-0bb5fc261a86e77d7"
          + name    = (known after apply)
          + version = "1"
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 10
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_security_group.eks_cluster will be updated in-place
~ resource "aws_security_group" "eks_cluster" {
        id                     = "sg-0cea2806beaf8453d"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.10.0.0/16",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.20.0.0/16",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
            # (1 unchanged element hidden)
        ]
        name                   = "eks-eksdapne2-aylw-cluster-sg"
        tags                   = {
            "Name"                                 = "eks-eksdapne2-aylw-cluster-sg"
            "account"                              = "id"
            "aws_region"                           = "ap-northeast-2"
            "kubernetes.io/cluster/eksdapne2-aylw" = "owned"
            "product"                              = "eks"
            "shard_id"                             = "eksdapne2"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 10 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p eks/eksd_apnortheast2/eksdapne2-aylw`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.devart.tv/lock?id=YoungJinJung%252Fterraform-provisioning%252Fterraform%252Feks%252Feksd_apnortheast2%252Feksdapne2-aylw%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p eks/eksd_apnortheast2/eksdapne2-aylw`
</details>
Plan: 10 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
